Обработки/Reports/_ИзменениеПортфеляАквилон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ИзменениеПортфеляАквилон</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ИзменениеПортфеляАквилон/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЭтаФорма.ШаблонExcel = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ШаблонExcel");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период");
		Возврат;
	КонецЕсли;
	
	ДанныеОтчета = ПолучитьДанныеОтчета();
	
	ИмяФайлаШаблонаExcel = ПолучитьИмяВременногоФайла("xls");

	ШаблонExcel.Записать(ИмяФайлаШаблонаExcel);
	
	// создадим документ MS Excel на основании сохраненного шаблона
	Excel = Новый COMОбъект("Excel.Application");
	Excel.Visible = Ложь;
	Excel.Workbooks.Open(ИмяФайлаШаблонаExcel);
	Excel.WorkSheets(1).Activate();
	
	Лист1 = Excel.WorkSheets(1);

	ЗаполнитьШапку(Лист1, ДанныеОтчета);
	РазмножитьКолонкиИСтроки(Лист1, ДанныеОтчета);
	ЗаполнитьВидыАктивов(Лист1, ДанныеОтчета);
	ЗаполнитьДоговоры(Лист1, ДанныеОтчета);
	ЗаполнитьПоказатели(Лист1, ДанныеОтчета);
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаШаблонаExcel);
	Исключение
	КонецПопытки;
	
	Excel.Visible = True;
	
КонецПроцедуры

#Область ПолучениеДанных
	
&НаСервере
Функция ПолучитьДанныеОтчета()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Сессия = Неопределено;
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОтчетОбъект, "Организация,Клиент,Период");
	Механизм = "ИзменениеПортфеляАквилон.ФормаОтчета.ПолучитьДанныеОтчета()";
    Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация"		, ОтчетОбъект.Организация);
	Запрос.УстановитьПараметр("Клиент"			, ОтчетОбъект.Клиент);
	Запрос.УстановитьПараметр("ДатаНачала"		, ОтчетОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"	, ОтчетОбъект.Период.ДатаОкончания);
	
#Область ТекстЗапроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	ВЫБОР СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ""Пенсионые накопления""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ""Пенсионные резервы""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
		|			ТОГДА ""Собственные средства""
		|	КОНЕЦ КАК ВидДоговораСтрокой,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
		|	И НЕ СчетаДоверительногоУправления.ПометкаУдаления
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаОкончания
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаНачала)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации) КАК ВидАктива,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ _ОбязательныеВидыАктивов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции),
		|	1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""РЕПО"",
		|	2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства),
		|	3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность),
		|	4
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность),
		|	4
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СтоимостьПереоценки.Рынок КАК ВидАктива,
		|	1 КАК Приоритет,
		|	СУММА(СтоимостьПереоценки.СуммаНаНачало) КАК СуммаНаНачало,
		|	СУММА(СтоимостьПереоценки.СуммаНаКонец) КАК СуммаНаКонец
		|ПОМЕСТИТЬ _СтоимостьПереоценки
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		СтоимостьПереоценкиНаНачало.Рынок КАК Рынок,
		|		СтоимостьПереоценкиНаНачало.СуммаВВалютеУчета + СтоимостьПереоценкиНаНачало.СуммаКупонаВВалютеУчета КАК СуммаНаНачало,
		|		0 КАК СуммаНаКонец
		|	ИЗ
		|		_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценкиНаНачало
		|			ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = СтоимостьПереоценкиНаНачало.СчетДоверительногоУправления
		|				И (СтоимостьПереоценкиНаНачало.Активность)
		|				И (СтоимостьПереоценкиНаНачало.Организация = &Организация)
		|				И (СтоимостьПереоценкиНаНачало.Период = НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ))
		|				И (СтоимостьПереоценкиНаНачало.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
		|				И (СтоимостьПереоценкиНаНачало.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
		|				И (СтоимостьПереоценкиНаНачало.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_СчетаДоверительногоУправления.СчетДоверительногоУправления,
		|		СтоимостьПереоценкиНаКонец.Рынок,
		|		0,
		|		СтоимостьПереоценкиНаКонец.СуммаВВалютеУчета + СтоимостьПереоценкиНаКонец.СуммаКупонаВВалютеУчета
		|	ИЗ
		|		_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценкиНаКонец
		|			ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = СтоимостьПереоценкиНаКонец.СчетДоверительногоУправления
		|				И (СтоимостьПереоценкиНаКонец.Активность)
		|				И (СтоимостьПереоценкиНаКонец.Организация = &Организация)
		|				И (СтоимостьПереоценкиНаКонец.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|				И (СтоимостьПереоценкиНаКонец.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
		|				И (СтоимостьПереоценкиНаКонец.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
		|				И (СтоимостьПереоценкиНаКонец.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки))) КАК СтоимостьПереоценки
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.СчетДоверительногоУправления,
		|	СтоимостьПереоценки.Рынок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеЦБ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СтоимостьАктивовНеЦБ.ВидАктива КАК ВидАктива,
		|	СтоимостьАктивовНеЦБ.Приоритет КАК Приоритет,
		|	СУММА(СтоимостьАктивовНеЦБ.СуммаНаНачало) КАК СуммаНаНачало,
		|	СУММА(СтоимостьАктивовНеЦБ.СуммаНаКонец) КАК СуммаНаКонец
		|ПОМЕСТИТЬ _СтоимостьАктивовНеЦБ
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ВЫБОР
		|			КОГДА СтоимостьАктивовНеЦБНаНачало.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				ТОГДА ""РЕПО""
		|			КОГДА СтоимостьАктивовНеЦБНаНачало.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады))
		|				ТОГДА ""Денежные средства""
		|			ИНАЧЕ СтоимостьАктивовНеЦБНаНачало.ВидАктива
		|		КОНЕЦ КАК ВидАктива,
		|		ВЫБОР
		|			КОГДА СтоимостьАктивовНеЦБНаНачало.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				ТОГДА 2
		|			КОГДА СтоимостьАктивовНеЦБНаНачало.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады))
		|				ТОГДА 3
		|			ИНАЧЕ 4
		|		КОНЕЦ КАК Приоритет,
		|		СтоимостьАктивовНеЦБНаНачало.СуммаРынокВВалютеУчета КАК СуммаНаНачало,
		|		0 КАК СуммаНаКонец
		|	ИЗ
		|		_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеЦБНаНачало
		|			ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = СтоимостьАктивовНеЦБНаНачало.СчетДоверительногоУправления
		|				И (СтоимостьАктивовНеЦБНаНачало.Активность)
		|				И (СтоимостьАктивовНеЦБНаНачало.Организация = &Организация)
		|				И (СтоимостьАктивовНеЦБНаНачало.Период = НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_СчетаДоверительногоУправления.СчетДоверительногоУправления,
		|		ВЫБОР
		|			КОГДА СтоимостьАктивовНеЦБНаКонец.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				ТОГДА ""РЕПО""
		|			КОГДА СтоимостьАктивовНеЦБНаКонец.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады))
		|				ТОГДА ""Денежные средства""
		|			ИНАЧЕ СтоимостьАктивовНеЦБНаКонец.ВидАктива
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА СтоимостьАктивовНеЦБНаКонец.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				ТОГДА 2
		|			КОГДА СтоимостьАктивовНеЦБНаКонец.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства), ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады))
		|				ТОГДА 3
		|			ИНАЧЕ 4
		|		КОНЕЦ,
		|		0,
		|		СтоимостьАктивовНеЦБНаКонец.СуммаРынокВВалютеУчета
		|	ИЗ
		|		_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеЦБНаКонец
		|			ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = СтоимостьАктивовНеЦБНаКонец.СчетДоверительногоУправления
		|				И (СтоимостьАктивовНеЦБНаКонец.Активность)
		|				И (СтоимостьАктивовНеЦБНаКонец.Организация = &Организация)
		|				И (СтоимостьАктивовНеЦБНаКонец.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))) КАК СтоимостьАктивовНеЦБ
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьАктивовНеЦБ.СчетДоверительногоУправления,
		|	СтоимостьАктивовНеЦБ.ВидАктива,
		|	СтоимостьАктивовНеЦБ.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_ОбязательныеВидыАктивов.ВидАктива, ВсеАктивы.ВидАктива) КАК ВидАктива,
		|	ЕСТЬNULL(_ОбязательныеВидыАктивов.Приоритет,ВсеАктивы.Приоритет) КАК Приоритет,
		|	ЕСТЬNULL(ВсеАктивы.СуммаНаНачало, 0) КАК СуммаНаНачало,
		|	ЕСТЬNULL(ВсеАктивы.СуммаНаКонец, 0) КАК СуммаНаКонец
		|ПОМЕСТИТЬ _ВсеАктивы
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОбязательныеВидыАктивов КАК _ОбязательныеВидыАктивов
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_СтоимостьПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_СтоимостьПереоценки.ВидАктива КАК ВидАктива,
		|			_СтоимостьПереоценки.Приоритет КАК Приоритет,
		|			_СтоимостьПереоценки.СуммаНаНачало КАК СуммаНаНачало,
		|			_СтоимостьПереоценки.СуммаНаКонец КАК СуммаНаКонец
		|		ИЗ
		|			_СтоимостьПереоценки КАК _СтоимостьПереоценки
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_СтоимостьАктивовНеЦБ.СчетДоверительногоУправления,
		|			_СтоимостьАктивовНеЦБ.ВидАктива,
		|			_СтоимостьАктивовНеЦБ.Приоритет,
		|			_СтоимостьАктивовНеЦБ.СуммаНаНачало,
		|			_СтоимостьАктивовНеЦБ.СуммаНаКонец
		|		ИЗ
		|			_СтоимостьАктивовНеЦБ КАК _СтоимостьАктивовНеЦБ) КАК ВсеАктивы
		|		ПО (_СчетаДоверительногоУправления.СчетДоверительногоУправления = ВсеАктивы.СчетДоверительногоУправления
		|					И _ОбязательныеВидыАктивов.ВидАктива = ВсеАктивы.ВидАктива
		|				ИЛИ _ОбязательныеВидыАктивов.ВидАктива ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ВсеАктивы.ВидАктива КАК ВидАктива,
		|	_ВсеАктивы.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ _ВидыАктивов
		|ИЗ
		|	_ВсеАктивы КАК _ВсеАктивы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыУК.КраткоеНаименованиеПоУставу КАК НаименованиеУК,
		|	РеквизитыКлиента.КраткоеНаименованиеПоУставу КАК НаименованиеКлиента
		|ПОМЕСТИТЬ _РеквизитыШапки
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо = &Клиент) КАК РеквизитыКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|					&ДатаОкончания,
		|					Организация = &Организация
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыУК
		|			ПО Организации.ЮрФизЛицо = РеквизитыУК.ЮрФизЛицо
		|		ПО РеквизитыКлиента.Организация = Организации.Ссылка
		|ГДЕ
		|	Организации.Ссылка = &Организация";
	
#КонецОбласти

	Запрос.Выполнить();

	ДанныеОтчета = Новый Структура("НаименованиеУК,НаименованиеКлиента");
	
	РеквизитыШапки = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РеквизитыШапки").ПолучитьДанные().Выбрать();
	Если РеквизитыШапки.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеОтчета, РеквизитыШапки);
	КонецЕсли;
	
	ДанныеОтчета.Вставить("СчетаДоверительногоУправления"	, СериализоватьТаблицу(Запрос, "СчетаДоверительногоУправления", "НомерДоговора")); 
	ДанныеОтчета.Вставить("ВидыАктивов"						, СериализоватьТаблицу(Запрос, "ВидыАктивов", "Приоритет,ВидАктива")); 
	ДанныеОтчета.Вставить("ВсеАктивы"						, СериализоватьТаблицу(Запрос, "ВсеАктивы"));
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Возврат ДанныеОтчета;
	
КонецФункции

&НаСервереБезКонтекста
Функция СериализоватьТаблицу(Запрос, ИмяТаблицы, Сортировка = "")
	
	Данные = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_" + ИмяТаблицы).ПолучитьДанные().Выгрузить();
	
	Если ЗначениеЗаполнено(Сортировка) Тогда
		Данные.Сортировать(Сортировка);
	КонецЕсли;
	
	МассивИменКолонок = Новый Массив;
	МассивСтрокДанных = Новый Массив;
	
	Для Каждого Колонка Из Данные.Колонки Цикл
		МассивИменКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	КолонкиТаблицы = СтрСоединить(МассивИменКолонок, ",");
	
	Для Каждого СтрокаДанных Из Данные Цикл
		СтруктураСтрокиДанных = Новый Структура(КолонкиТаблицы);
		ЗаполнитьЗначенияСвойств(СтруктураСтрокиДанных, СтрокаДанных);
		МассивСтрокДанных.Добавить(СтруктураСтрокиДанных);
	КонецЦикла;
	
	Возврат МассивСтрокДанных;
	
КонецФункции

#КонецОбласти

#Область Вывод
	
&НаКлиенте
Процедура ЗаполнитьШапку(Лист1, ДанныеОтчета)
	
	Лист1.Cells(1, 1).Value = ДанныеОтчета.НаименованиеУК;
	Лист1.Cells(2, 1).Value = "Клиент: " + ДанныеОтчета.НаименованиеКлиента;
	Лист1.Cells(3, 1).Value = "Дата отчета: " + Формат(Отчет.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	
КонецПроцедуры

&НаКлиенте
Процедура РазмножитьКолонкиИСтроки(Лист1, ДанныеОтчета)
	
	КоличествоДоговоров		= ДанныеОтчета.СчетаДоверительногоУправления.Количество();
	КоличествоВидовАктивов	= ДанныеОтчета.ВидыАктивов.Количество();
	
	Для Индекс = 1 По КоличествоДоговоров - 1 Цикл 
		Область = Лист1.Range(Лист1.Cells(1,3),Лист1.Cells(1,4));
		Область.EntireColumn.Select();
		Область.EntireColumn.Copy();
		Область.EntireColumn.Insert();
	КонецЦикла;	
	
	Для Индекс = 1 По КоличествоВидовАктивов - 1 Цикл 
		Область = Лист1.Cells(9,1);
		Область.EntireRow.Select();
		Область.EntireRow.Copy();
		Область.EntireRow.Insert();
		
		Область = Лист1.Cells(12 + Индекс,1);
		Область.EntireRow.Select();
		Область.EntireRow.Copy();
		Область.EntireRow.Insert();
		
		Область = Лист1.Range(Лист1.Cells(15 + Индекс * 2,1), Лист1.Cells(16 + Индекс * 2,1));
		Область.EntireRow.Select();
		Область.EntireRow.Copy();
		Область.EntireRow.Insert();
	КонецЦикла;
	
	НомерСтроки = 5;
	Лист1.Range(Лист1.Cells(НомерСтроки,3), Лист1.Cells(НомерСтроки, 2 + КоличествоДоговоров * 2)).Merge(Истина);
	Лист1.Range(Лист1.Cells(НомерСтроки,3), Лист1.Cells(НомерСтроки, 2 + КоличествоДоговоров * 2)).Value = "Договоры";
	
	НомерСтроки = 8;
	Лист1.Range(Лист1.Cells(НомерСтроки,3), Лист1.Cells(НомерСтроки, 2 + КоличествоДоговоров * 2)).Merge(Истина);
	Лист1.Range(Лист1.Cells(НомерСтроки,3), Лист1.Cells(НомерСтроки, 2 + КоличествоДоговоров * 2)).Value = "Активы на " + Формат(Отчет.Период.ДатаНачала, "ДФ=dd.MM.yyyy");
	
	НомерСтроки = 10 + КоличествоВидовАктивов;
	Лист1.Range(Лист1.Cells(НомерСтроки,3), Лист1.Cells(НомерСтроки, 2 + КоличествоДоговоров * 2)).Merge(Истина);
	Лист1.Range(Лист1.Cells(НомерСтроки,3), Лист1.Cells(НомерСтроки, 2 + КоличествоДоговоров * 2)).Value = "Активы на " + Формат(Отчет.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	
	НомерСтроки = 12 + КоличествоВидовАктивов * 2;
	Лист1.Range(Лист1.Cells(НомерСтроки,3), Лист1.Cells(НомерСтроки, 2 + КоличествоДоговоров * 2)).Merge(Истина);
	Лист1.Range(Лист1.Cells(НомерСтроки,3), Лист1.Cells(НомерСтроки, 2 + КоличествоДоговоров * 2)).Value = "Изменение активов";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидыАктивов(Лист1, ДанныеОтчета)
	
	КоличествоВидовАктивов	= ДанныеОтчета.ВидыАктивов.Количество();
	
	НомерКолонки = 1;
	
	НачалоПервойТаблицы = 9;
	НачалоВторойТаблицы = 11 + КоличествоВидовАктивов;
	НачалоТртьейТаблицы = 13 + КоличествоВидовАктивов * 2;
	
	Для Индекс = 0 По КоличествоВидовАктивов - 1 Цикл 
		СтрокаВидыАктивов = ДанныеОтчета.ВидыАктивов[Индекс];
		
		Лист1.Cells(НачалоПервойТаблицы + Индекс, НомерКолонки).Value 		= Строка(СтрокаВидыАктивов.ВидАктива);	
		Лист1.Cells(НачалоВторойТаблицы + Индекс, НомерКолонки).Value 		= Строка(СтрокаВидыАктивов.ВидАктива);	
		Лист1.Cells(НачалоТртьейТаблицы + Индекс * 2, НомерКолонки).Value	= Строка(СтрокаВидыАктивов.ВидАктива);	
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговоры(Лист1, ДанныеОтчета)
	
	КоличествоДоговоров		= ДанныеОтчета.СчетаДоверительногоУправления.Количество();
	
	НомерСтрокиВидаДоговра = 6;
	НомерСтрокиНомераДоговра = 7;
	
	Для Индекс = 0 По КоличествоДоговоров - 1 Цикл 
		СтрокаСчетаДоверительногоУправления = ДанныеОтчета.СчетаДоверительногоУправления[Индекс];
		
		НомерКолонки = 3 + Индекс * 2;
		
		Лист1.Cells(НомерСтрокиВидаДоговра, НомерКолонки).Value 		= Строка(СтрокаСчетаДоверительногоУправления.ВидДоговораСтрокой);	
		Лист1.Range(Лист1.Cells(НомерСтрокиНомераДоговра, НомерКолонки), Лист1.Cells(НомерСтрокиНомераДоговра, НомерКолонки + 1)).Value = Строка(СтрокаСчетаДоверительногоУправления.НомерДоговора);	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказатели(Лист1, ДанныеОтчета)
	
	КоличествоВидовАктивов	= ДанныеОтчета.ВидыАктивов.Количество();
	КоличествоДоговоров		= ДанныеОтчета.СчетаДоверительногоУправления.Количество();
	
	НомерКолонки = 1;
	
	НачалоПервойТаблицы = 9;
	НачалоВторойТаблицы = 11 + КоличествоВидовАктивов;
	НачалоТртьейТаблицы = 13 + КоличествоВидовАктивов * 2;
	
	ИтогПервойТаблицы = НачалоПервойТаблицы + КоличествоВидовАктивов;
	ИтогВторойТаблицы = НачалоВторойТаблицы + КоличествоВидовАктивов;
	
	Для ИндексД = 0 По КоличествоДоговоров - 1 Цикл 
		СтрокаСчетаДоверительногоУправления = ДанныеОтчета.СчетаДоверительногоУправления[ИндексД];
		НомерКолонки = 3 + ИндексД * 2;
		
		Для ИндексА = 0 По КоличествоВидовАктивов - 1 Цикл 
			СтрокаВидыАктивов = ДанныеОтчета.ВидыАктивов[ИндексА];
			
			Лист1.Cells(НачалоПервойТаблицы + ИндексА, НомерКолонки).Value = 0;	
			Лист1.Cells(НачалоВторойТаблицы + ИндексА, НомерКолонки).Value = 0;	
			
			Для Каждого СтрокаВсеАктивы Из ДанныеОтчета.ВсеАктивы Цикл
				Если СтрокаВсеАктивы.ВидАктива = СтрокаВидыАктивов.ВидАктива
				   И СтрокаВсеАктивы.СчетДоверительногоУправления = СтрокаСчетаДоверительногоУправления.СчетДоверительногоУправления Тогда
					Лист1.Cells(НачалоПервойТаблицы + ИндексА, НомерКолонки).Value = СтрокаВсеАктивы.СуммаНаНачало;	
					Лист1.Cells(НачалоВторойТаблицы + ИндексА, НомерКолонки).Value = СтрокаВсеАктивы.СуммаНаКонец;
				КонецЕсли;
			КонецЦикла;	
			
			Лист1.Cells(НачалоПервойТаблицы + ИндексА, НомерКолонки + 1).FormulaR1C1Local = СтрШаблон("=ЕСЛИОШИБКА(RC[-1]/R%1C[-1]*100;0)", ИтогПервойТаблицы);
			Лист1.Cells(НачалоВторойТаблицы + ИндексА, НомерКолонки + 1).FormulaR1C1Local = СтрШаблон("=ЕСЛИОШИБКА(RC[-1]/R%1C[-1]*100;0)", ИтогВторойТаблицы);
			
			Лист1.Cells(НачалоТртьейТаблицы + ИндексА * 2, НомерКолонки).FormulaR1C1Local			= СтрШаблон("=R%1C-R%2C", НачалоВторойТаблицы + ИндексА, НачалоПервойТаблицы + ИндексА);
			Лист1.Cells(НачалоТртьейТаблицы + ИндексА * 2 + 1, НомерКолонки + 1).FormulaR1C1Local	= СтрШаблон("=R%1C-R%2C", НачалоВторойТаблицы + ИндексА, НачалоПервойТаблицы + ИндексА);
			
			Лист1.Cells(НачалоТртьейТаблицы + ИндексА * 2 + 1, НомерКолонки).FormulaR1C1Local		= СтрШаблон("=ЕСЛИОШИБКА(R[-1]C/R%1C*100;0)", НачалоПервойТаблицы + ИндексА);
			
		КонецЦикла;
		
		Лист1.Cells(НачалоПервойТаблицы + КоличествоВидовАктивов, НомерКолонки).FormulaR1C1Local = СтрШаблон("=СУММ(R[-%1]C:R[-1]C)", КоличествоВидовАктивов);
		Лист1.Cells(НачалоВторойТаблицы + КоличествоВидовАктивов, НомерКолонки).FormulaR1C1Local = СтрШаблон("=СУММ(R[-%1]C:R[-1]C)", КоличествоВидовАктивов);
		
		Лист1.Cells(НачалоПервойТаблицы + КоличествоВидовАктивов, НомерКолонки + 1).FormulaR1C1Local = СтрШаблон("=СУММ(R[-%1]C:R[-1]C)", КоличествоВидовАктивов);
		Лист1.Cells(НачалоВторойТаблицы + КоличествоВидовАктивов, НомерКолонки + 1).FormulaR1C1Local = СтрШаблон("=СУММ(R[-%1]C:R[-1]C)", КоличествоВидовАктивов);
		
		Лист1.Cells(НачалоТртьейТаблицы + КоличествоВидовАктивов * 2, НомерКолонки).FormulaR1C1Local		= СтрШаблон("=R%1C-R%2C", ИтогВторойТаблицы, ИтогПервойТаблицы);
		Лист1.Cells(НачалоТртьейТаблицы + КоличествоВидовАктивов * 2 + 1, НомерКолонки).FormulaR1C1Local	= СтрШаблон("=ЕСЛИОШИБКА(R[-1]C/R%1C*100;0)", ИтогПервойТаблицы);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
